duvallee/drone_transmitter_bt_nrf51822/nrf51_uart_peripheral/main.c
/* Copyright (c) 2014 Nordic Semiconductor. All Rights Reserved.
 *
 * The information contained herein is property of Nordic Semiconductor ASA.
 * Terms and conditions of usage are described in detail in NORDIC
 * SEMICONDUCTOR STANDARD SOFTWARE LICENSE AGREEMENT.
 *
 * Licensees are granted free, non-transferable use of the information. NO
 * WARRANTY of ANY KIND is provided. This heading must NOT be removed from
 * the file.
 *
 */

/** @file
 *
 * @defgroup ble_sdk_uart_over_ble_main main.c
 * @{
 * @ingroup  ble_sdk_app_nus_eval
 * @brief    UART over BLE application main file.
 *
 * This file contains the source code for a sample application that uses the Nordic UART service.
 * This application uses the @ref srvlib_conn_params module.
 */

#include <stdint.h>
#include <string.h>
#include "nordic_common.h"
#include "nrf.h"
#include "ble_hci.h"
#include "ble_advdata.h"
#include "ble_advertising.h"
#include "ble_conn_params.h"
#include "softdevice_handler.h"
#include "app_timer.h"
#include "app_button.h"
#include "ble_nus.h"
#include "app_uart.h"
#include "app_util_platform.h"
#include "bsp.h"
#include "bsp_btn_ble.h"


#define SERIAL_RECEIVER

#if defined(SERIAL_RECEIVER)

// receiver type
#define SERIAL_RX_SPEKTRUM_1024
//#define SERIAL_RX_SPEKTRUM_2048
// #define SERIAL_RX_S_BUS
// #define SERIAL_RX_SUMD
// #define SERIAL_RX_SUMH
// #define SERIAL_RX_MODE_B
// #define SERIAL_RX_MODE_B_BJ01
// #define SERIAL_RX_IBUS
// #define SERIAL_RX_MSP

#define RX_CHANNEL_ROLL                                  0
#define RX_CHANNEL_PITCH                                 1
#define RX_CHANNEL_YAW                                   2
#define RX_CHANNEL_THROTTLE                              3

void app_sleep()
{
static int app_sleep_count                               = 100;
   int i;
   for (i = 0; i < app_sleep_count; i++)
   {
   }
}

#if defined(SERIAL_RX_SPEKTRUM_1024)

// UART
// BAUDRATE : 125000 bps, or 1152000 bps
// DATA     : 8 bits
// PARITY   : NO Parity
// stop bit : 1 stop

#define SERIAL_RX_BAUDRATE                               (UART_BAUDRATE_BAUDRATE_Baud115200)
#define DEVICE_NAME                                      "RX-SPEKTRUM-1024"         /**< Name of device. Will be included in the advertising data. */
// 22 ms : (32768 * 22) / 1000
#define SERIAL_RX_UPDATE_TICK_COUNT                      720

#define SERIAL_RX_ROLL_MIN                               0
#define SERIAL_RX_ROLL_MAX                               1023
#define SERIAL_RX_ROLL_DEFAULT                           512

#define SERIAL_RX_PITCH_MIN                              0
#define SERIAL_RX_PITCH_MAX                              1023
#define SERIAL_RX_PITCH_DEFAULT                          512

#define SERIAL_RX_YAW_MIN                                0
#define SERIAL_RX_YAW_MAX                                1023
#define SERIAL_RX_YAW_DEFAULT                            512

#define SERIAL_RX_THROTTLE_MIN                           0
#define SERIAL_RX_THROTTLE_MAX                           1023
#define SERIAL_RX_THROTTLE_DEFAULT                       100

#elif defined(SERIAL_RX_SPEKTRUM_2048)

// UART
// BAUDRATE : 125000 bps, or 1152000 bps
// DATA     : 8 bits
// PARITY   : NO Parity
// stop bit : 1 stop

#define SERIAL_RX_BAUDRATE                               (UART_BAUDRATE_BAUDRATE_Baud115200)
#define DEVICE_NAME                                      "RX-SPEKTRUM-2048"         /**< Name of device. Will be included in the advertising data. */
// 11 ms : (32768 * 11) / 1000
#define SERIAL_RX_UPDATE_TICK_COUNT                      360

#define SERIAL_RX_ROLL_MIN                               0
#define SERIAL_RX_ROLL_MAX                               2047
#define SERIAL_RX_ROLL_DEFAULT                           1024

#define SERIAL_RX_PITCH_MIN                              0
#define SERIAL_RX_PITCH_MAX                              2047
#define SERIAL_RX_PITCH_DEFAULT                          1024

#define SERIAL_RX_YAW_MIN                                0
#define SERIAL_RX_YAW_MAX                                2047
#define SERIAL_RX_YAW_DEFAULT                            1024

#define SERIAL_RX_THROTTLE_MIN                           0
#define SERIAL_RX_THROTTLE_MAX                           2047
#define SERIAL_RX_THROTTLE_DEFAULT                       200

#elif defined(SERIAL_RX_S_BUS)
#define DEVICE_NAME                                      "RX-S-BUS"                 /**< Name of device. Will be included in the advertising data. */
#elif defined(SERIAL_RX_SUMD)
#define DEVICE_NAME                                      "RX-SUMD"                  /**< Name of device. Will be included in the advertising data. */
#elif defined(SERIAL_RX_SUMH)
#define DEVICE_NAME                                      "RX-SUMH"                  /**< Name of device. Will be included in the advertising data. */
#elif defined(SERIAL_RX_MODE_B)
#define DEVICE_NAME                                      "RX-MODE-B"                /**< Name of device. Will be included in the advertising data. */
#elif defined(SERIAL_RX_MODE_B_BJ01)
#define DEVICE_NAME                                      "RX-MODE-B-BJ01"           /**< Name of device. Will be included in the advertising data. */
#elif defined(SERIAL_RX_IBUS)
#define DEVICE_NAME                                      "RX-MODE-IBUS"             /**< Name of device. Will be included in the advertising data. */
#elif defined(SERIAL_RX_MSP)
#define DEVICE_NAME                                      "RX-MODE-MSP"              /**< Name of device. Will be included in the advertising data. */
#else
#define DEVICE_NAME                                      "Nordic_UART"              /**< Name of device. Will be included in the advertising data. */
#endif


// -----------------------------------------------------------------------------
// protocol for phone and bt's receiver
#define SERIAL_BT_COMMAND_MAX_SIZE                       32
static uint8_t g_bt_rx_command[SERIAL_BT_COMMAND_MAX_SIZE];

static uint8_t g_bt_rx_command_complete                  = 0;

static uint32_t g_prev_tick_count                        = 0;
static uint32_t g_update_tick_count                      = 0;

static uint8_t g_update_packet_complete                  = 0;
// -----------------------------------------------------------------------------

#define SERIAL_BT_COMMAND_DECREASE_FLAG                  0xF000
typedef struct
{
   uint8_t channel_id;
   uint16_t value;
   char command[SERIAL_BT_COMMAND_MAX_SIZE];
} SERIAL_BT_COMMAND;

typedef struct
{
   uint8_t channel_id;
   uint16_t min;
   uint16_t max;
   uint16_t failsafe_value;
   uint16_t value;
} RX_CHANNEL;

static SERIAL_BT_COMMAND g_bt_command[]                  =
{
   { RX_CHANNEL_ROLL,                                        1,      "ROLL-UP"},
   { RX_CHANNEL_ROLL,     SERIAL_BT_COMMAND_DECREASE_FLAG |  1,      "ROLL-DOWN"},
   { RX_CHANNEL_PITCH,                                       1,      "PITCH-UP"},
   { RX_CHANNEL_PITCH,    SERIAL_BT_COMMAND_DECREASE_FLAG |  1,      "PITCH-DOWN"},
   { RX_CHANNEL_YAW,                                         1,      "YAW-UP"},
   { RX_CHANNEL_YAW,      SERIAL_BT_COMMAND_DECREASE_FLAG |  1,      "YAW-DOWN"},
   { RX_CHANNEL_THROTTLE,                                    1,      "THROTTLE-UP"},
   { RX_CHANNEL_THROTTLE,  SERIAL_BT_COMMAND_DECREASE_FLAG | 1,      "THROTTLE-DOWN"},
};

static RX_CHANNEL g_rx_channel[]                         =
{
   { RX_CHANNEL_ROLL,         SERIAL_RX_ROLL_MIN,     SERIAL_RX_ROLL_MAX,     SERIAL_RX_ROLL_DEFAULT,       SERIAL_RX_ROLL_DEFAULT},
   { RX_CHANNEL_PITCH,        SERIAL_RX_PITCH_MIN,    SERIAL_RX_PITCH_MAX,    SERIAL_RX_PITCH_DEFAULT,      SERIAL_RX_PITCH_DEFAULT},
   { RX_CHANNEL_YAW,          SERIAL_RX_YAW_MIN,      SERIAL_RX_YAW_MAX,      SERIAL_RX_YAW_DEFAULT,        SERIAL_RX_YAW_DEFAULT},
   { RX_CHANNEL_THROTTLE,     SERIAL_RX_THROTTLE_MIN, SERIAL_RX_THROTTLE_MAX, SERIAL_RX_THROTTLE_DEFAULT,   SERIAL_RX_THROTTLE_DEFAULT},
};

