duvallee/drone_transmitter_bt_nrf51822/nrf51_uart_peripheral/main.c
uint8_t update_receiver_command()
{
   uint8_t i                                             = 0;
   uint16_t level_value                                  = 0;
   uint8_t max_command                                   = sizeof(g_bt_command) / sizeof(SERIAL_BT_COMMAND);

   for (i = 0; i < max_command; i++)
   {
      if (strcmp(g_bt_command[i].command, (char*) g_bt_rx_command) == 0)
      {
         level_value                                     = (g_bt_command[i].value & 0xFFF);
         if ((g_bt_command[i].value & SERIAL_BT_COMMAND_DECREASE_FLAG) == 0)
         {
            if ((g_rx_channel[g_bt_command[i].channel_id].value + level_value) > g_rx_channel[g_bt_command[i].channel_id].max)
            {
               g_rx_channel[g_bt_command[i].channel_id].value   = g_rx_channel[g_bt_command[i].channel_id].max;
            }
            else
            {
               g_rx_channel[g_bt_command[i].channel_id].value  += level_value;
            }
         }
         else
         {
            if ((g_rx_channel[g_bt_command[i].channel_id].value - level_value) <= g_rx_channel[g_bt_command[i].channel_id].min)
            {
               g_rx_channel[g_bt_command[i].channel_id].value   = g_rx_channel[g_bt_command[i].channel_id].min;
            }
            else
            {
               g_rx_channel[g_bt_command[i].channel_id].value  -= level_value;
            }
            if (g_rx_channel[g_bt_command[i].channel_id].value > g_rx_channel[g_bt_command[i].channel_id].max)
            {
               g_rx_channel[g_bt_command[i].channel_id].value   = g_rx_channel[g_bt_command[i].channel_id].min;
            }
         }
#if 0
         printf("%s = %d \r\n", g_bt_command[i].command, g_rx_channel[g_bt_command[i].channel_id].value);
#endif
         return 0;
      }
   }
   return -1;
}

#if defined(SERIAL_RX_SPEKTRUM_1024)

#define MASK_1024_CHANID                                 0xFC00
#define MASK_1024_SXPOS                                  0x03FF

#define SPEKTRUM_1024_CHANNEL_SHIFT_BITS                 10

#define MAX_CHANNEL_COUNT                                7

#define DSM2_22MS                                        0x01                    // 1024
#define DSM2_11MS                                        0x12                    // 2048
#define DSMS_22MS                                        0xA2                    // 2048
#define DSMX_11MS                                        0xB2                    // 2048

#if 1
#define SPEKTRUM_CHANNEL_THROTTLE                        3
#define SPEKTRUM_CHANNEL_AILERON                         0
#define SPEKTRUM_CHANNEL_ELEVATOR                        1
#define SPEKTRUM_CHANNEL_RUDDER                          2
#else
#define SPEKTRUM_CHANNEL_THROTTLE                        0
#define SPEKTRUM_CHANNEL_AILERON                         1
#define SPEKTRUM_CHANNEL_ELEVATOR                        2
#define SPEKTRUM_CHANNEL_RUDDER                          3
#endif
#define SPEKTRUM_CHANNEL_GEAR                            4
#define SPEKTRUM_CHANNEL_AUX_1                           5
#define SPEKTRUM_CHANNEL_AUX_2                           6
#define SPEKTRUM_CHANNEL_AUX_3                           7
#define SPEKTRUM_CHANNEL_AUX_4                           8
#define SPEKTRUM_CHANNEL_AUX_5                           9
#define SPEKTRUM_CHANNEL_AUX_6                           10
#define SPEKTRUM_CHANNEL_AUX_7                           11

typedef struct
{
   uint8_t fades;
   uint8_t system;
   uint16_t channel[MAX_CHANNEL_COUNT];
} RX_PACKET_SPEKTRUM_1024;

#define RX_PACKET_SPEKTRUM_CHANNEL_ID_0                  0
#define RX_PACKET_SPEKTRUM_CHANNEL_ID_1                  1
#define RX_PACKET_SPEKTRUM_CHANNEL_ID_2                  2
#define RX_PACKET_SPEKTRUM_CHANNEL_ID_3                  3
#define RX_PACKET_SPEKTRUM_CHANNEL_ID_4                  4
#define RX_PACKET_SPEKTRUM_CHANNEL_ID_5                  5
#define RX_PACKET_SPEKTRUM_CHANNEL_ID_6                  6


#define UART_RETRY_SEND_COUNT                            5
uint8_t send_receiver_command()
{
   RX_PACKET_SPEKTRUM_1024 packet;
   uint8_t retry_count;
   uint8_t* stream_packet                                = (uint8_t*) &packet;
   int i;
   memset(&packet, 0, sizeof(RX_PACKET_SPEKTRUM_1024));

   UNUSED_VARIABLE(retry_count);
   UNUSED_VARIABLE(i);

   // missed frames for remote
   // always is null
   packet.fades                                          = 0;
   packet.system                                         = 0;

   // throttle (드론 상승, 하강)
   packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_0]       = (MASK_1024_CHANID & (SPEKTRUM_CHANNEL_THROTTLE << SPEKTRUM_1024_CHANNEL_SHIFT_BITS))       |
                                                           (g_rx_channel[RX_CHANNEL_THROTTLE].value & MASK_1024_SXPOS);

   // Aileron (좌측 이동, 우측 이동)
   packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_1]       = (MASK_1024_CHANID & (SPEKTRUM_CHANNEL_AILERON << SPEKTRUM_1024_CHANNEL_SHIFT_BITS))        |
                                                           (g_rx_channel[RX_CHANNEL_ROLL].value & MASK_1024_SXPOS);

   // Elevator (전진, 후진)
   packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_2]       = (MASK_1024_CHANID & (SPEKTRUM_CHANNEL_ELEVATOR << SPEKTRUM_1024_CHANNEL_SHIFT_BITS))       |
                                                           (g_rx_channel[RX_CHANNEL_PITCH].value & MASK_1024_SXPOS);

   // Rudder (시계방향 회전, 반 시계방향 회전)
   packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_3]       = (MASK_1024_CHANID & (SPEKTRUM_CHANNEL_RUDDER << SPEKTRUM_1024_CHANNEL_SHIFT_BITS))         |
                                                           (g_rx_channel[RX_CHANNEL_YAW].value & MASK_1024_SXPOS);

   // GEAR
   packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_4]       = (MASK_1024_CHANID & (SPEKTRUM_CHANNEL_GEAR << SPEKTRUM_1024_CHANNEL_SHIFT_BITS))           |
                                                           (0x200 & MASK_1024_SXPOS);
   // ADC 1
   packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_5]       = (MASK_1024_CHANID & (SPEKTRUM_CHANNEL_AUX_2 << SPEKTRUM_1024_CHANNEL_SHIFT_BITS))          |
                                                           (0x200 & MASK_1024_SXPOS);

