duvallee/drone_transmitter_bt_nrf51822/nrf51_uart_peripheral/main.c
   // ADC 2
   packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_6]       = (MASK_1024_CHANID & (SPEKTRUM_CHANNEL_AUX_3 << SPEKTRUM_1024_CHANNEL_SHIFT_BITS))          |
                                                           (0x200 & MASK_1024_SXPOS);

#if 0
   {
      printf("\r\n");
      for (i = 0; i < sizeof(RX_PACKET_SPEKTRUM_1024); i++)
      {
         printf("[%02x] ", *(stream_packet + i));
      }
  }
#endif

#if 1
   __sd_nvic_irq_disable();
   for (i = 0; i < sizeof(RX_PACKET_SPEKTRUM_1024); i++)
   {
      retry_count                                        = 0;
      while(app_uart_put(*(stream_packet + i)) != NRF_SUCCESS)
      {
         if (UART_RETRY_SEND_COUNT < retry_count++)
         {
            return 1;
         }
      }
//      app_sleep();
   }
   __sd_nvic_irq_enable();
#endif

#if 0
   {
      printf("\r\n");
      printf("[%02x] [%02x] ",   packet.fades, packet.system);
      printf("[%02x] [%02x] : ", (uint8_t) ((packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_0] >> 8) & 0xFF),
                                 (uint8_t) ((packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_0]     ) & 0xFF));
      printf("[%02x] [%02x] : ", (uint8_t) ((packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_1] >> 8) & 0xFF),
                                 (uint8_t) ((packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_1]     ) & 0xFF));
      printf("[%02x] [%02x] : ", (uint8_t) ((packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_2] >> 8) & 0xFF),
                                 (uint8_t) ((packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_2]     ) & 0xFF));
      printf("[%02x] [%02x] : ", (uint8_t) ((packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_3] >> 8) & 0xFF),
                                 (uint8_t) ((packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_3]     ) & 0xFF));
      printf("[%02x] [%02x] : ", (uint8_t) ((packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_4] >> 8) & 0xFF),
                                 (uint8_t) ((packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_4]     ) & 0xFF));
      printf("[%02x] [%02x] : ", (uint8_t) ((packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_5] >> 8) & 0xFF),
                                 (uint8_t) ((packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_5]     ) & 0xFF));
      printf("[%02x] [%02x] ",   (uint8_t) ((packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_6] >> 8) & 0xFF),
                                 (uint8_t) ((packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_6]     ) & 0xFF));
   }
#endif
   return 0;
}

#elif defined(SERIAL_RX_SPEKTRUM_2048)

#define MASK_2048_PHASE                                  0x8000
#define MASK_2048_CHANID                                 0x7800
#define MASK_2048_SXPOS                                  0x07FF

#define SPEKTRUM_2048_CHANNEL_SHIFT_BITS                 11

#define MAX_CHANNEL_COUNT                                7

#define DSM2_22MS                                        0x01                    // 1024
#define DSM2_11MS                                        0x12                    // 2048
#define DSMS_22MS                                        0xA2                    // 2048
#define DSMX_11MS                                        0xB2                    // 2048

#define SPEKTRUM_CHANNEL_THROTTLE                        0
#define SPEKTRUM_CHANNEL_AILERON                         1
#define SPEKTRUM_CHANNEL_ELEVATOR                        2
#define SPEKTRUM_CHANNEL_RUDDER                          3
#define SPEKTRUM_CHANNEL_GEAR                            4
#define SPEKTRUM_CHANNEL_AUX_1                           5
#define SPEKTRUM_CHANNEL_AUX_2                           6
#define SPEKTRUM_CHANNEL_AUX_3                           7
#define SPEKTRUM_CHANNEL_AUX_4                           8
#define SPEKTRUM_CHANNEL_AUX_5                           9
#define SPEKTRUM_CHANNEL_AUX_6                           10
#define SPEKTRUM_CHANNEL_AUX_7                           11

typedef struct
{
   uint8_t fades;
   uint8_t system;
   uint16_t channel[MAX_CHANNEL_COUNT];
} RX_PACKET_SPEKTRUM_1024;

#define RX_PACKET_SPEKTRUM_CHANNEL_ID_0                  0
#define RX_PACKET_SPEKTRUM_CHANNEL_ID_1                  1
#define RX_PACKET_SPEKTRUM_CHANNEL_ID_2                  2
#define RX_PACKET_SPEKTRUM_CHANNEL_ID_3                  3
#define RX_PACKET_SPEKTRUM_CHANNEL_ID_4                  4
#define RX_PACKET_SPEKTRUM_CHANNEL_ID_5                  5
#define RX_PACKET_SPEKTRUM_CHANNEL_ID_6                  6

uint8_t send_receiver_command()
{
   RX_PACKET_SPEKTRUM_1024 packet;
   memset(&packet, 0, sizeof(RX_PACKET_SPEKTRUM_1024));

   // missed frames for remote
   // always is null
   packet.fades                                          = 0;
   // type of receiver
   packet.system                                         = DSMX_11MS;

   // throttle (드론 상승, 하강)
   packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_0]       = (MASK_2048_CHANID & (SPEKTRUM_CHANNEL_THROTTLE << SPEKTRUM_2048_CHANNEL_SHIFT_BITS))       |
                                                           (g_rx_channel[RX_CHANNEL_THROTTLE].value & MASK_2048_SXPOS);

   // Aileron (좌측 이동, 우측 이동)
   packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_1]       = (MASK_2048_CHANID & (SPEKTRUM_CHANNEL_AILERON << SPEKTRUM_2048_CHANNEL_SHIFT_BITS))        |
                                                           (g_rx_channel[RX_CHANNEL_ROLL].value & MASK_2048_SXPOS);

   // Elevator (전진, 후진)
   packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_2]       = (MASK_2048_CHANID & (SPEKTRUM_CHANNEL_ELEVATOR << SPEKTRUM_2048_CHANNEL_SHIFT_BITS))       |
                                                           (g_rx_channel[RX_CHANNEL_PITCH].value & MASK_2048_SXPOS);

   // Rudder (시계방향 회전, 반 시계방향 회전)
   packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_3]       = (MASK_2048_CHANID & (SPEKTRUM_CHANNEL_RUDDER << SPEKTRUM_2048_CHANNEL_SHIFT_BITS))         |
                                                           (g_rx_channel[RX_CHANNEL_YAW].value & MASK_2048_SXPOS);

   // GEAR
   packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_4]       = (MASK_2048_CHANID & (SPEKTRUM_CHANNEL_GEAR << SPEKTRUM_2048_CHANNEL_SHIFT_BITS))           |
                                                           (0x400 & MASK_2048_SXPOS);
   // ADC 1
   packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_5]       = (MASK_2048_CHANID & (SPEKTRUM_CHANNEL_AUX_2 << SPEKTRUM_2048_CHANNEL_SHIFT_BITS))          |
                                                           (0x400 & MASK_2048_SXPOS);

